; domain
(define (domain gripper-typed)
   (:requirements :typing)
   (:types room ball gripper)
   (:constants left right - gripper)
   (:predicates (at-robby ?dummy - room ?r - room)
		(at ?dummy - ball ?b - ball ?r - room)
		(free ?dummy - gripper ?g - gripper)
		(carry ?dummy - ball ?o - ball ?g - gripper))

   (:action move
       :parameters  (?from ?to - room)
       :precondition (at-robby ?from ?from)
       :effect (and  (at-robby ?to ?to)
		     (not (at-robby ?from ?from))))



   (:action pick
       :parameters (?obj - ball ?room - room ?gripper - gripper)
       :precondition  (and  (at ?obj ?obj ?room) (at-robby ?room ?room) (free ?gripper ?gripper))
       :effect (and (carry ?obj ?obj ?gripper)
		    (not (at ?obj ?obj ?room))
		    (not (free ?gripper ?gripper))))


   (:action drop
       :parameters  (?obj - ball ?room - room ?gripper - gripper)
       :precondition  (and  (carry ?obj ?obj ?gripper) (at-robby ?room ?room))
       :effect (and (at ?obj ?obj ?room)
		    (free ?gripper ?gripper)
		    (not (carry ?obj ?obj ?gripper)))))

; problem
(define (problem gripper-x-9)
   (:domain gripper-typed)
   (:objects rooma roomb - room
             ball20 ball19 ball18 ball17 ball16 ball15 ball14 ball13 ball12
             ball11 ball10 ball9 ball8 ball7 ball6 ball5 ball4 ball3 ball2
             ball1 - ball)
   (:init (at-robby rooma rooma)
          (free left left)
          (free right right)
          (at ball20 ball20 rooma)
          (at ball19 ball19 rooma)
          (at ball18 ball18 rooma)
          (at ball17 ball17 rooma)
          (at ball16 ball16 rooma)
          (at ball15 ball15 rooma)
          (at ball14 ball14 rooma)
          (at ball13 ball13 rooma)
          (at ball12 ball12 rooma)
          (at ball11 ball11 rooma)
          (at ball10 ball10 rooma)
          (at ball9 ball9 rooma)
          (at ball8 ball8 rooma)
          (at ball7 ball7 rooma)
          (at ball6 ball6 rooma)
          (at ball5 ball5 rooma)
          (at ball4 ball4 rooma)
          (at ball3 ball3 rooma)
          (at ball2 ball2 rooma)
          (at ball1 ball1 rooma))
   (:goal (and (at ball20 ball20 roomb)
               (at ball19 ball19 roomb)
               (at ball18 ball18 roomb)
               (at ball17 ball17 roomb)
               (at ball16 ball16 roomb)
               (at ball15 ball15 roomb)
               (at ball14 ball14 roomb)
               (at ball13 ball13 roomb)
               (at ball12 ball12 roomb)
               (at ball11 ball11 roomb)
               (at ball10 ball10 roomb)
               (at ball9 ball9 roomb)
               (at ball8 ball8 roomb)
               (at ball7 ball7 roomb)
               (at ball6 ball6 roomb)
               (at ball5 ball5 roomb)
               (at ball4 ball4 roomb)
               (at ball3 ball3 roomb)
               (at ball2 ball2 roomb)
               (at ball1 ball1 roomb))))

; plan
1. (pick ball19 rooma left)
   deleted: (at ball19 ball19 rooma) (free left left)
   added: (carry ball19 ball19 left)
   goals met: 0 of 20
2. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 0 of 20
3. (drop ball19 roomb left)
   deleted: (carry ball19 ball19 left)
   added: (at ball19 ball19 roomb) (free left left)
   goals met: 1 of 20
4. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 1 of 20
5. (pick ball1 rooma left)
   deleted: (at ball1 ball1 rooma) (free left left)
   added: (carry ball1 ball1 left)
   goals met: 1 of 20
6. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 1 of 20
7. (drop ball1 roomb left)
   deleted: (carry ball1 ball1 left)
   added: (at ball1 ball1 roomb) (free left left)
   goals met: 2 of 20
8. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 2 of 20
9. (pick ball2 rooma right)
   deleted: (at ball2 ball2 rooma) (free right right)
   added: (carry ball2 ball2 right)
   goals met: 2 of 20
10. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 2 of 20
11. (drop ball2 roomb right)
   deleted: (carry ball2 ball2 right)
   added: (at ball2 ball2 roomb) (free right right)
   goals met: 3 of 20
12. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 3 of 20
13. (pick ball10 rooma left)
   deleted: (at ball10 ball10 rooma) (free left left)
   added: (carry ball10 ball10 left)
   goals met: 3 of 20
14. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 3 of 20
15. (drop ball10 roomb left)
   deleted: (carry ball10 ball10 left)
   added: (at ball10 ball10 roomb) (free left left)
   goals met: 4 of 20
16. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 4 of 20
17. (pick ball11 rooma right)
   deleted: (at ball11 ball11 rooma) (free right right)
   added: (carry ball11 ball11 right)
   goals met: 4 of 20
18. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 4 of 20
19. (drop ball11 roomb right)
   deleted: (carry ball11 ball11 right)
   added: (at ball11 ball11 roomb) (free right right)
   goals met: 5 of 20
20. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 5 of 20
21. (pick ball12 rooma left)
   deleted: (at ball12 ball12 rooma) (free left left)
   added: (carry ball12 ball12 left)
   goals met: 5 of 20
22. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 5 of 20
23. (drop ball12 roomb left)
   deleted: (carry ball12 ball12 left)
   added: (at ball12 ball12 roomb) (free left left)
   goals met: 6 of 20
24. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 6 of 20
25. (pick ball20 rooma right)
   deleted: (at ball20 ball20 rooma) (free right right)
   added: (carry ball20 ball20 right)
   goals met: 6 of 20
26. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 6 of 20
27. (drop ball20 roomb right)
   deleted: (carry ball20 ball20 right)
   added: (at ball20 ball20 roomb) (free right right)
   goals met: 7 of 20
28. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 7 of 20
29. (pick ball13 rooma left)
   deleted: (at ball13 ball13 rooma) (free left left)
   added: (carry ball13 ball13 left)
   goals met: 7 of 20
30. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 7 of 20
31. (drop ball13 roomb left)
   deleted: (carry ball13 ball13 left)
   added: (at ball13 ball13 roomb) (free left left)
   goals met: 8 of 20
32. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 8 of 20
33. (pick ball3 rooma right)
   deleted: (at ball3 ball3 rooma) (free right right)
   added: (carry ball3 ball3 right)
   goals met: 8 of 20
34. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 8 of 20
35. (drop ball3 roomb right)
   deleted: (carry ball3 ball3 right)
   added: (at ball3 ball3 roomb) (free right right)
   goals met: 9 of 20
36. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 9 of 20
37. (pick ball14 rooma left)
   deleted: (at ball14 ball14 rooma) (free left left)
   added: (carry ball14 ball14 left)
   goals met: 9 of 20
38. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 9 of 20
39. (drop ball14 roomb left)
   deleted: (carry ball14 ball14 left)
   added: (at ball14 ball14 roomb) (free left left)
   goals met: 10 of 20
40. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 10 of 20
41. (pick ball17 rooma right)
   deleted: (at ball17 ball17 rooma) (free right right)
   added: (carry ball17 ball17 right)
   goals met: 10 of 20
42. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 10 of 20
43. (drop ball17 roomb right)
   deleted: (carry ball17 ball17 right)
   added: (at ball17 ball17 roomb) (free right right)
   goals met: 11 of 20
44. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 11 of 20
45. (pick ball6 rooma left)
   deleted: (at ball6 ball6 rooma) (free left left)
   added: (carry ball6 ball6 left)
   goals met: 11 of 20
46. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 11 of 20
47. (drop ball6 roomb left)
   deleted: (carry ball6 ball6 left)
   added: (at ball6 ball6 roomb) (free left left)
   goals met: 12 of 20
48. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 12 of 20
49. (pick ball7 rooma right)
   deleted: (at ball7 ball7 rooma) (free right right)
   added: (carry ball7 ball7 right)
   goals met: 12 of 20
50. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 12 of 20
51. (drop ball7 roomb right)
   deleted: (carry ball7 ball7 right)
   added: (at ball7 ball7 roomb) (free right right)
   goals met: 13 of 20
52. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 13 of 20
53. (pick ball15 rooma left)
   deleted: (at ball15 ball15 rooma) (free left left)
   added: (carry ball15 ball15 left)
   goals met: 13 of 20
54. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 13 of 20
55. (drop ball15 roomb left)
   deleted: (carry ball15 ball15 left)
   added: (at ball15 ball15 roomb) (free left left)
   goals met: 14 of 20
56. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 14 of 20
57. (pick ball16 rooma right)
   deleted: (at ball16 ball16 rooma) (free right right)
   added: (carry ball16 ball16 right)
   goals met: 14 of 20
58. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 14 of 20
59. (drop ball16 roomb right)
   deleted: (carry ball16 ball16 right)
   added: (at ball16 ball16 roomb) (free right right)
   goals met: 15 of 20
60. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 15 of 20
61. (pick ball18 rooma left)
   deleted: (at ball18 ball18 rooma) (free left left)
   added: (carry ball18 ball18 left)
   goals met: 15 of 20
62. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 15 of 20
63. (drop ball18 roomb left)
   deleted: (carry ball18 ball18 left)
   added: (at ball18 ball18 roomb) (free left left)
   goals met: 16 of 20
64. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 16 of 20
65. (pick ball4 rooma right)
   deleted: (at ball4 ball4 rooma) (free right right)
   added: (carry ball4 ball4 right)
   goals met: 16 of 20
66. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 16 of 20
67. (drop ball4 roomb right)
   deleted: (carry ball4 ball4 right)
   added: (at ball4 ball4 roomb) (free right right)
   goals met: 17 of 20
68. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 17 of 20
69. (pick ball5 rooma left)
   deleted: (at ball5 ball5 rooma) (free left left)
   added: (carry ball5 ball5 left)
   goals met: 17 of 20
70. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 17 of 20
71. (drop ball5 roomb left)
   deleted: (carry ball5 ball5 left)
   added: (at ball5 ball5 roomb) (free left left)
   goals met: 18 of 20
72. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 18 of 20
73. (pick ball8 rooma right)
   deleted: (at ball8 ball8 rooma) (free right right)
   added: (carry ball8 ball8 right)
   goals met: 18 of 20
74. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 18 of 20
75. (drop ball8 roomb right)
   deleted: (carry ball8 ball8 right)
   added: (at ball8 ball8 roomb) (free right right)
   goals met: 19 of 20
76. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 19 of 20
77. (pick ball9 rooma left)
   deleted: (at ball9 ball9 rooma) (free left left)
   added: (carry ball9 ball9 left)
   goals met: 19 of 20
78. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 19 of 20
79. (drop ball9 roomb left)
   deleted: (carry ball9 ball9 left)
   added: (at ball9 ball9 roomb) (free left left)
   goals met: 20 of 20
